src/test/java/com/mercadopago/resources/mocks/response/preference/preference_base.json

{
  "additional_info": "Discount: 12.00",
  "auto_return": "all",
  "back_urls": {
    "failure": "http://test.com/failure",
    "pending": "http://test.com/pending",
    "success": "http://test.com/success"
  },
  "binary_mode": true,
  "client_id": "6245132082630004",
  "collector_id": 823549964,
  "coupon_code": null,
  "coupon_labels": null,
  "date_created": "2022-01-10T10:10:10.000+00:00",
  "date_of_expiration": "2022-02-10T10:10:10.000+00:00",
  "expiration_date_from": "2022-01-10T10:10:10.000+00:00",
  "expiration_date_to": "2022-02-10T10:10:10.000+00:00",
  "expires": false,
  "external_reference": "1643827245",
  "id": "823549964-e8063b12-1c8b-4333-b075-3ae52a0371c8",
  "init_point": "https://www.mercadopago.com.br/checkout/v1/redirect?pref_id=823549964-e8063b12-1c8b-4333-b075-3ae52a0371c8",
  "internal_metadata": null,
  "items": [
    {
      "id": "1234",
      "category_id": "games",
      "currency_id": "BRL",
      "description": "PS5",
      "picture_url": "http://picture.com/PS5",
      "title": "Games",
      "quantity": 2,
      "unit_price": 4000
    }
  ],
  "marketplace": "NONE",
  "marketplace_fee": 5,
  "metadata": {},
  "notification_url": "http://notificationurl.com",
  "operation_type": "regular_payment",
  "payer": {
    "phone": {
      "area_code": "11",
      "number": "4444-4444"
    },
    "address": {
      "zip_code": "06233200",
      "street_name": "Street",
      "street_number": "123"
    },
    "email": "test_user_64585784@testuser.com",
    "identification": {
      "number": "19119119100",
      "type": "CPF"
    },
    "name": "Test",
    "surname": "User",
    "date_created": null,
    "last_purchase": null
  },
  "payment_methods": {
    "default_card_id": null,
    "default_payment_method_id": "master",
    "excluded_payment_methods": [
      {
        "id": ""
      }
    ],
    "excluded_payment_types": [
      {
        "id": "ticket"
      }
    ],
    "installments": 5,
    "default_installments": 1
  },
  "processing_modes": null,
  "product_id": null,
  "redirect_urls": {
    "failure": "",
    "pending": "",
    "success": ""
  },
  "sandbox_init_point": "https://sandbox.mercadopago.com.br/checkout/v1/redirect?pref_id=823549964-e8063b12-1c8b-4333-b075-3ae52a0371c8",
  "site_id": "MLB",
  "shipments": {
    "mode": "custom",
    "default_shipping_method": null,
    "cost": 10,
    "receiver_address": {
      "zip_code": "06000000",
      "street_name": "Street",
      "street_number": "123",
      "floor": "12",
      "apartment": "120A",
      "city_name": null,
      "state_name": null,
      "country_name": null
    }
  },
  "statement_descriptor": "Test Store",
  "total_amount": null,
  "last_updated": null
}